class Constants:
    part_of_speech_map = {
        'NOUN': 'Существительное',
        'ADJF': 'Прилагательное (полное)',
        'ADJS': 'Прилагательное (краткое)',
        'COMP': 'Компаратив',
        'VERB': 'Глагол',
        'INFN': 'Инфинитив',
        'PRTF': 'Причастие (полное)',
        'PRTS': 'Причастие (краткое)',
        'GRND': 'Деепричастие',
        'NUMR': 'Числительное',
        'ADVB': 'Наречие',
        'NPRO': 'Местоимение-существительное',
        'PRED': 'Предикатив',
        'PREP': 'Предлог',
        'CONJ': 'Союз',
        'PRCL': 'Частица',
        'INTJ': 'Междометие',
    }

    animation = {
        'anim': 'Одушевленность',
        'inan': 'Неодушевленность',
    }

    gender = {
        'masc': 'Мужской род',
        'femn': 'Женский род',
        'neut': 'Средний род',
    }

    number = {
        'sing': 'Единственное число',
        'plur': 'Множественное число',
    }

    case = {
        'nomn': 'Именительный падеж',
        'gent': 'Родительный падеж',
        'datv': 'Дательный падеж',
        'accs': 'Винительный падеж',
        'ablt': 'Творительный падеж',
        'loct': 'Предложный падеж',
        'voct': 'Звательный падеж',
        'gen1': 'Первый родительный падеж',
        'gen2': 'Второй родительный падеж',
        'acc2': 'Второй винительный падеж',
        'loc1': 'Первый предложный падеж',
        'loc2': 'Второй предложный падеж',
        'ablt2': 'Второй творительный падеж',
    }

    degree = {
        'supr': 'Превосходная степень',
        'comp': 'Сравнительная степень',
    }

    mest = {
        'Qual': 'Качественное',
        'Apro': 'Местоименное',
        'Anum': 'Порядковое',
        'poss': 'Притяжательное',
    }

    time = {
        'past': 'Прошедшее',
        'pres': 'Настоящее',
        'futr': 'Будущее'
    }

    type = {
        'impf': 'Несовершенный вид',
        'perf': 'Совершенный вид'
    }

    inclination = {
        'indc': 'Изъявительное наклонение',
        'impr': 'Повелительное наклонение',
        'cond': 'Условное наклонение',
        'sbst': 'Сослагательное наклонение'
    }





